{"weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/gamma"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/beta"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "conv_dw_1/depthwise_kernel"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_10/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_11/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_12/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 1024, 1], "name": "conv_dw_13/depthwise_kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/beta"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/gamma"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/beta"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "conv_dw_2/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/gamma"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/beta"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "conv_dw_3/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "conv_dw_4/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "conv_dw_5/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "conv_dw_6/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_7/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_8/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_9/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv_pw_1/kernel"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_10/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_11/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "name": "conv_pw_12/kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/beta"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 1024, 1024], "name": "conv_pw_13/kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/beta"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/gamma"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/beta"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "conv_pw_2/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv_pw_3/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv_pw_4/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv_pw_5/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "conv_pw_6/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_7/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_8/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_9/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/moving_variance"}]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "conv1_pad", "data_format": "channels_last"}, "name": "conv1_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv1_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv1_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_1_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_1_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_1_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_1_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_1_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "conv_pad_2", "data_format": "channels_last"}, "name": "conv_pad_2"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_2_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_2_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_2_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_2_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_2_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_3_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_3_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_3_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_3_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_3_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_3_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "conv_pad_4", "data_format": "channels_last"}, "name": "conv_pad_4"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_4_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_4_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_4_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_4_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_4_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_4_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_5_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_5_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_5_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_5_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_5_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_5_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "conv_pad_6", "data_format": "channels_last"}, "name": "conv_pad_6"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_6_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_6_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_6_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_6_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_6_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_6_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_7", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_7_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_7_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_7_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_7", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_7_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_7_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_7_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_8_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_8_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_8_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_8_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_8_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_8_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_9", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_9_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_9_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_9_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_9", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_9_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_9_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_9_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_10", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_10_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_10_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_10_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_10", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_10_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_10_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_10_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_11", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_11_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_11_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_11_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_11", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_11_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_11_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_11_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "conv_pad_12", "data_format": "channels_last"}, "name": "conv_pad_12"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_12", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_12_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_dw_12_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_dw_12_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv_pw_12", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_pw_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_12_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "conv_pw_12_bn"}, {"class_name": "ReLU", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "conv_pw_12_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "conv_dw_13", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_dw_13"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_13_bn", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": 